Revit 2027 API
PointOnEdgeFaceIntersection.OrientWithEdge Property
Whether to orient the ReferencePoint to the edge or the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool OrientWithEdge { get; set; }
Public Property OrientWithEdge As Boolean
	Get
	Set
public:
property bool OrientWithEdge {
	bool get ();
	void set (bool value);
}
member OrientWithEdge : bool with get, set
Property Value
Boolean
Remarks
If true, the X basis vector will be parallel to the edge. If false, the X and Y basis vectors will be parallel to the face.
See Also
Reference
PointOnEdgeFaceIntersection Class
Autodesk.Revit.DB Namespace